Pipe Size Table "[File Name]" is missing or invalid.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId InvalidPipeSize { get; }
  Visual Basic
Public Shared ReadOnly Property InvalidPipeSize As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ InvalidPipeSize {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures PipingFailures Class
  Autodesk.Revit.DB Namespace